{"_id":{"$oid":"667aaff0d2e4f08e1b79c886"},"title":"Hidden Figures","description":"The story of a team of female African-American mathematicians who served a vital role in NASA during the early years of the U.S. space program.","director":{"name":"Theodore Melfi","biography":"Theodore Melfi is an American film director, screenwriter, and producer known for his work on the films \"St. Vincent\" and \"Hidden Figures\".","birth":"1970"},"genre":{"name":"Drama","description":"Drama is a film genre that emphasizes realistic storytelling and character development, often dealing with serious, emotional, and thought-provoking themes. It focuses on the internal and external conflicts of characters, aiming to evoke a strong emotional response from the audience."}}
{"_id":{"$oid":"667ab0fad2e4f08e1b79c887"},"title":"Inception","description":"A thief who steals corporate secrets through the use of dream-sharing technology is given the inverse task of planting an idea into the mind of a C.E.O.","director":{"name":"Christopher Nolan","biography":"Christopher Nolan is a British-American film director, screenwriter, and producer.","birth":"1970"},"genre":{"name":"Science-Fiction","description":"Science-Fiction is a film genre that explores speculative, futuristic, and imaginative concepts such as advanced technology, space exploration, time travel, and extraterrestrial life. It often delves into the impact of scientific innovations on individuals and societies, blending scientific accuracy with creative storytelling."}}
{"_id":{"$oid":"667ab11ad2e4f08e1b79c888"},"title":"The Help","description":"An aspiring author during the civil rights movement of the 1960s decides to write a book.","director":{"name":"Tate Taylor","biography":"Tate Taylor is an American filmmaker and actor known for directing \"The Help\" and \"Get on Up\".","birth":"1969"},"genre":{"name":"Drama","description":"Drama is a film genre that emphasizes realistic storytelling and character development, often dealing with serious, emotional, and thought-provoking themes. It focuses on the internal and external conflicts of characters, aiming to evoke a strong emotional response from the audience."}}
{"_id":{"$oid":"667ab141d2e4f08e1b79c889"},"title":"Interstellar","description":"A team of explorers travel through a wormhole in space in an attempt to ensure humanity's survival.","director":{"name":"Christopher Nolan","biography":"Christopher Nolan is a British-American film director, screenwriter, and producer known for his distinctive nonlinear storytelling and his work on films like \"The Dark Knight Trilogy\" and \"Inception\".","birth":"1970"},"genre":{"name":"Science-Fiction","description":"Science-Fiction is a film genre that explores speculative, futuristic, and imaginative concepts such as advanced technology, space exploration, time travel, and extraterrestrial life. It often delves into the impact of scientific innovations on individuals and societies, blending scientific accuracy with creative storytelling."}}
{"_id":{"$oid":"667ab167d2e4f08e1b79c88a"},"title":"8 Mile","description":"A young rapper, struggling with every aspect of his life, wants to make the most of what could be his final opportunity but his problems around give him doubts.","director":{"name":"Curtis Hanson","biography":"Curtis Hanson was an American director, screenwriter, and producer known for his work on films such as \"L.A. Confidential\" and \"8 Mile\".","birth":"1945","death":"2016"},"genre":{"name":"Music","description":"Music is a film genre that centers around the creation, performance, and significance of music, often featuring musicians, bands, or musical themes as central elements of the story. It explores the impact of music on the characters' lives and frequently includes performances or a strong musical score integrated into the narrative."}}
{"_id":{"$oid":"667ab189d2e4f08e1b79c88b"},"title":"Intouchables","description":"After he becomes a quadriplegic from a paragliding accident, an aristocrat hires a young man from the projects to be his caregiver.","director":{"name":"Olivier Nakache","biography":"Olivier Nakache is a French director and screenwriter known for co-directing \"The Intouchables\" with Éric Toledano.","birth":"1973"},"genre":{"name":"Tragicomedy","description":"Tragicomedy is a film genre that combines elements of both tragedy and comedy, often featuring characters facing serious, sometimes devastating situations that are interspersed with humorous or lighthearted moments. This blend aims to evoke both laughter and empathy, reflecting the complexity of real-life experiences."}}
{"_id":{"$oid":"667ab1a0d2e4f08e1b79c88c"},"title":"The Wolf of Wall Street","description":"Based on the true story of Jordan Belfort, from his rise to a wealthy stock-broker living the high life to his fall involving crime, corruption, and the federal government.","director":{"name":"Martin Scorsese","biography":"Martin Scorsese is an American director, producer, screenwriter, and actor, known for his work in the film industry and his classics such as \"Taxi Driver\", \"Goodfellas\", and \"The Wolf of Wall Street\".","birth":"1942"},"genre":{"name":"Biography","description":"Biography is a film genre that dramatizes the life of a real person, focusing on their personal and professional experiences, significant achievements, and challenges. It aims to provide an in-depth and authentic portrayal of the individual's life, often highlighting their impact on society or history."}}
{"_id":{"$oid":"667ab1b3d2e4f08e1b79c88d"},"title":"Barbie","description":"Barbie embarks on a journey of self-discovery after being expelled from Barbieland for being a less-than-perfect doll.","director":{"name":"Greta Gerwig","biography":"Greta Gerwig is an American actress, screenwriter, and director known for her work on films like \"Lady Bird\" and \"Little Women\".","birth":"1983"},"genre":{"name":"Comedy","description":"Comedy is a film genre designed to entertain and amuse the audience through humor, featuring witty dialogue, humorous situations, and physical antics. It often aims to provoke laughter and provide a lighthearted, enjoyable experience."}}
{"_id":{"$oid":"667ab1c5d2e4f08e1b79c88e"},"title":"Top Gun","description":"As students at the United States Navy's elite fighter weapons school compete to be best in the class, one daring young pilot learns a few things from a civilian instructor that are not taught in the classroom.","director":{"name":"Tony Scott","biography":"Tony Scott was an English film director and producer known for his action-packed films including \"Top Gun\" and \"True Romance\".","birth":"1944","death":"2012"},"genre":{"name":"Action","description":"Action is a film genre characterized by high-energy sequences, including physical feats, chases, fights, and explosions, often involving a clear protagonist facing challenges or adversaries. The genre focuses on excitement, tension, and spectacle, frequently with a fast-paced narrative."}}
{"_id":{"$oid":"667ab1d8d2e4f08e1b79c88f"},"title":"The Greatest Showman","description":"Celebrates the birth of show business and tells of a visionary who rose from nothing to create a spectacle that became a worldwide sensation.","director":{"name":"Michael Gracey","biography":"Michael Gracey is an Australian director and visual effects artist known for his directorial debut with \"The Greatest Showman\".","birth":"1975"},"genre":{"name":"Musical","description":"Musical is a film genre in which songs sung by the characters are interwoven into the narrative, often accompanied by dance routines. The music and lyrics play a central role in advancing the plot, developing characters, and enhancing the emotional resonance of the story."}}
{"_id":{"$oid":"667ab201d2e4f08e1b79c890"},"title":"Forrest Gump","description":"The presidencies of Kennedy and Johnson, the Vietnam War, the Watergate scandal and other historical events unfold from the perspective of an Alabama man with an IQ of 75.","director":{"name":"Robert Zemeckis","biography":"Robert Zemeckis is an American director, producer, and screenwriter renowned for his innovative use of special effects and his work on films like \"Back to the Future\" and \"Forrest Gump\".","birth":"1952"},"genre":{"name":"Adventure","description":"Adventure is a film genre characterized by exciting and often hazardous journeys, explorations, or quests, frequently set in exotic or remote locations. The genre focuses on action-packed sequences, heroic characters, and the pursuit of thrilling, often dangerous objectives."}}
